In [1]:
#누락데이터 확인
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

df =sns.load_dataset('titanic')

df.head()

Bad key "text.kerning_factor" on line 4 in
/home/jingon/anaconda3/envs/project/lib/python3.6/site-packages/matplotlib/mpl-data/stylelib/_classic_test_patch.mplstyle.
You probably need to get an updated matplotlibrc file from
https://github.com/matplotlib/matplotlib/blob/v3.1.3/matplotlibrc.template
or from the matplotlib source distribution

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:

df.info()

# 정보 확인해보면 dec열에 누락 데이터 있는 것을 확인할 수 있다

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [6]:

#누락 데이터  개수 구하기
nan_deck=df['deck'].value_counts(dropna=False)
print(nan_deck)

#dropna는 무조건 False 아니면 NaN데이터 빼고 출력해준다.

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [7]:
#누락데이터 직접 확인
print(df.head().isnull())# 누락이면 True 반환 (notnull()은 반대)

   survived  pclass    sex    age  sibsp  parch   fare  embarked  class  \
0     False   False  False  False  False  False  False     False  False
1     False   False  False  False  False  False  False     False  False
2     False   False  False  False  False  False  False     False  False
3     False   False  False  False  False  False  False     False  False
4     False   False  False  False  False  False  False     False  False

     who  adult_male   deck  embark_town  alive  alone
0  False       False   True        False  False  False
1  False       False  False        False  False  False
2  False       False   True        False  False  False
3  False       False  False        False  False  False
4  False       False   True        False  False  False

In [51]:
#누락데이터 개수 

print(df.isnull().sum(axis=0))

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [11]:
# 누락데이터 가져오기
missing_df = df.isnull()
for col in missing_df.columns:
    missing_count=missing_df[col].value_counts() #각 열의 NaN 개수 파악
    
    try:
        print(col,':',missing_count[True])
    except:
        print(col,':',0)

survived : 0
pclass : 0
sex : 0
age : 177
sibsp : 0
parch : 0
fare : 0
embarked : 2
class : 0
who : 0
adult_male : 0
deck : 688
embark_town : 2
alive : 0
alone : 0

In [49]:
#NaN 값이 500개 이상인 열 모두 삭제 
df_thresh = df.dropna(axis=1,thresh=500)
print(df_thresh.columns)

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [60]:
#누락 데이터 제거

df_age= df.dropna(subset=['age'],how='any',axis=0)# 데이터 없는 열 모두 삭제
print(len(df_age))

714

In [61]:
print(df_age.isnull().sum(axis=0))

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           530
embark_town      2
alive            0
alone            0
dtype: int64

In [63]:
#평균으로 누락 데이터 바꾸기
mean_age = df['age'].mean(axis=0)# 평균값 NaN 제외
df['age'].fillna(mean_age,inplace=True)# NaN값에 평균값 대입
print(df['age'].head(10))

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: age, dtype: float64

In [72]:
#가장 많이 나타난 값으로 바꾸기 

print(df['embark_town'][825:830])
print('\n')
most_freq=df['embark_town'].value_counts(dropna=True).idxmax() # NaN값 제외 가장 많이 출현한 값 
df['embark_town'].fillna(most_freq,inplace=True)
print(df['embark_town'][825:830])

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object


825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
Name: embark_town, dtype: object

In [76]:
#이웃하고 있는 값으로 바꾸기 
print(df['embark_town'][825:830])
df['embark_town'].fillna(method='ffill',inplace=True)#바로 옆 828 행 값으로 변경 
print(df['embark_town'][825:830])

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829     Queenstown
Name: embark_town, dtype: object
825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829     Queenstown
Name: embark_town, dtype: object

In [81]:
#중복 데이터 처리하기 

import pandas as pd 

df=pd.DataFrame({'c1':['a','a','b','a','b'],'c2':[1,1,1,2,2],'c3':[1,1,2,2,2]})
print(df)
print('\n')

df_dup = df.duplicated()
print(df_dup)
print('\n')

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2


0    False
1     True
2    False
3    False
4    False
dtype: bool

In [85]:
#특정 열에서 중복값 찾기
col_dup=df['c2'].duplicated()
print(col_dup,'\n',df['c2'])

0    False
1     True
2     True
3    False
4     True
Name: c2, dtype: bool
 0    1
1    1
2    1
3    2
4    2
Name: c2, dtype: int64

In [103]:
#중복 행 제거하기
df=pd.DataFrame({'c1':['a','a','b','a','b'],'c2':[1,1,1,2,2],'c3':[1,1,2,2,2]})
print(df,'\n')
df2=df.drop_duplicates() 

df2.index=[df.index[0:4]]
print(df2)

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

  c1  c2  c3
0  a   1   1
1  b   1   2
2  a   2   2
3  b   2   2

In [105]:
#중복 데이터 제거
df3 = df.drop_duplicates(subset=['c2','c3'])
print(df3)

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2

In [112]:
#단위환산

df=pd.read_csv('./part4/auto-mpg.csv',header=None)
df.columns=['mpg','cylinders','displacement','horsepower','weight','acceleration','model year','origin','name']
print(df.head(3))
print('\n')


mpg_to_kpl=1.60934/3.78541
df['kpl']=df['mpg']*mpg_to_kpl
print(df.head(3))
print('\n')


df['kpl']=df['kpl'].round(2)
print(df.head(3))

    mpg  cylinders  displacement horsepower  weight  acceleration  model year  \
0  18.0          8         307.0      130.0  3504.0          12.0          70
1  15.0          8         350.0      165.0  3693.0          11.5          70
2  18.0          8         318.0      150.0  3436.0          11.0          70

   origin                       name
0       1  chevrolet chevelle malibu
1       1          buick skylark 320
2       1         plymouth satellite


    mpg  cylinders  displacement horsepower  weight  acceleration  model year  \
0  18.0          8         307.0      130.0  3504.0          12.0          70
1  15.0          8         350.0      165.0  3693.0          11.5          70
2  18.0          8         318.0      150.0  3436.0          11.0          70

   origin                       name       kpl
0       1  chevrolet chevelle malibu  7.652571
1       1          buick skylark 320  6.377143
2       1         plymouth satellite  7.652571


    mpg  cylinders  displacement horsepower  weight  acceleration  model year  \
0  18.0          8         307.0      130.0  3504.0          12.0          70
1  15.0          8         350.0      165.0  3693.0          11.5          70
2  18.0          8         318.0      150.0  3436.0          11.0          70

   origin                       name   kpl
0       1  chevrolet chevelle malibu  7.65
1       1          buick skylark 320  6.38
2       1         plymouth satellite  7.65

In [116]:
# 자료형 변환 
df=pd.read_csv('./part4/auto-mpg.csv',header=None)
df.columns=['mpg','cylinders','displacement','horsepower','weight','acceleration','model year','origin','name']
print(df.dtypes)
print('\n')



print(df['horsepower'].unique()) # ? NaN 으로 바꿔줘야함 
print('\n')


df['horsepower'].replace('?',np.nan,inplace=True)# NaN으로 바꿔줌
df.dropna(subset=['horsepower'],axis=0,inplace=True)# NaN있는 행 제거 
df['horsepower']=df['horsepower'].astype('float')# 실수형으로 변환 


print(df['horsepower'].dtypes)

mpg             float64
cylinders         int64
displacement    float64
horsepower       object
weight          float64
acceleration    float64
model year        int64
origin            int64
name             object
dtype: object


['130.0' '165.0' '150.0' '140.0' '198.0' '220.0' '215.0' '225.0' '190.0'
 '170.0' '160.0' '95.00' '97.00' '85.00' '88.00' '46.00' '87.00' '90.00'
 '113.0' '200.0' '210.0' '193.0' '?' '100.0' '105.0' '175.0' '153.0'
 '180.0' '110.0' '72.00' '86.00' '70.00' '76.00' '65.00' '69.00' '60.00'
 '80.00' '54.00' '208.0' '155.0' '112.0' '92.00' '145.0' '137.0' '158.0'
 '167.0' '94.00' '107.0' '230.0' '49.00' '75.00' '91.00' '122.0' '67.00'
 '83.00' '78.00' '52.00' '61.00' '93.00' '148.0' '129.0' '96.00' '71.00'
 '98.00' '115.0' '53.00' '81.00' '79.00' '120.0' '152.0' '102.0' '108.0'
 '68.00' '58.00' '149.0' '89.00' '63.00' '48.00' '66.00' '139.0' '103.0'
 '125.0' '133.0' '138.0' '135.0' '142.0' '77.00' '62.00' '132.0' '84.00'
 '64.00' '74.00' '116.0' '82.00']


float64

In [7]:
#구간 분할
import pandas as pd 
import numpy as np
df=pd.read_csv('./part4/auto-mpg.csv',header=None)
df.columns=['mpg','cylinders','displacement','horsepower','weight','acceleration','model year','origin','name']
df['horsepower'].replace('?',np.nan,inplace=True)# ? NaN으로 변경
df.dropna(subset=['horsepower'],axis=0,inplace=True)# 누락행 제거
df['horsepower']= df['horsepower'].astype('float')#실수형을 변환



#np.histogram 함수로 3개의 bin으로 구분할 경계값의 리스트 구하기(개수와 리스트 반환)
count,bin_dividers = np.histogram(df['horsepower'],bins=3)


print(bin_dividers)
print("\n")
print(count)

[ 46.         107.33333333 168.66666667 230.        ]


[257 103  32]

In [12]:
# 3개 bin에 이름 설정 
bin_names=['저출력','보통출력','고출력']

#pd.cut 함수로 각 데이터를 3개의 bin에 할당

df['hp_bin']= pd.cut(x=df['horsepower'], # 데이터 배열
                    bins=bin_dividers,   # 경계갑 리스트
                    labels=bin_names,    # bin 이름
                    include_lowest=True) # 첫 경계값 포함

print(df[['horsepower','hp_bin']].head(15))

    horsepower hp_bin
0        130.0   보통출력
1        165.0   보통출력
2        150.0   보통출력
3        150.0   보통출력
4        140.0   보통출력
5        198.0    고출력
6        220.0    고출력
7        215.0    고출력
8        225.0    고출력
9        190.0    고출력
10       170.0    고출력
11       160.0   보통출력
12       150.0   보통출력
13       225.0    고출력
14        95.0    저출력

In [18]:
# 더미 변수 
# 숫자형 연속데이터를 범주형 데이터로 변환하였지만 컴퓨터 인식 가능한 입력값 더미 변수로 바꾸어 주어야 한다. 

horsepower_dummies =pd.get_dummies(df['hp_bin'])
horsepower_dummies.index=df['horsepower'][0:]
print(horsepower_dummies.head(15))

            저출력  보통출력  고출력
horsepower
130.0         0     1    0
165.0         0     1    0
150.0         0     1    0
150.0         0     1    0
140.0         0     1    0
198.0         0     0    1
220.0         0     0    1
215.0         0     0    1
225.0         0     0    1
190.0         0     0    1
170.0         0     0    1
160.0         0     1    0
150.0         0     1    0
225.0         0     0    1
95.0          1     0    0

In [19]:
#원핫인코딩 
#머신러닝 알고리즘은 문자열 값 입력값 허락 x
#모든 문자열 값을 숫자형으로 인코딩하는 전처리 과정 필요함 
#라벨 인코딩, 원 핫 인코딩 두가지가 있다
#라벨 인코딩은 일괄적 숫자값 변환되어 예측 성능이 떨어질 수 잇음
# 라벨 인코딩은 선형회귀와 같은 ML알고리즘에는 적용 x 
# 트리계열 ML알고리즘은 숫자의 특성 반영 안하므로 괜찮음
from sklearn import preprocessing

label_encoder = preprocessing.LabelEncoder(); #라벨 인코더
onehot_encoder = preprocessing.OneHotEncoder();#onehot인코더

#label encoder 로 범주를 숫자형 범주로 변환

onehot_labeled = label_encoder.fit_transform(df['hp_bin'].head(15))
print(onehot_labeled)

[1 1 1 1 1 0 0 0 0 0 0 1 1 0 2]

In [23]:
#2차원 행렬로 변경
onehot_reshaped =onehot_labeled.reshape(len(onehot_labeled),1)
print(onehot_reshaped)

[[1]
 [1]
 [1]
 [1]
 [1]
 [0]
 [0]
 [0]
 [0]
 [0]
 [0]
 [1]
 [1]
 [0]
 [2]]

In [24]:
# 희소행렬로 변환
onehot_fitted =onehot_encoder.fit_transform(onehot_reshaped)
print(onehot_fitted)

  (0, 1)	1.0
  (1, 1)	1.0
  (2, 1)	1.0
  (3, 1)	1.0
  (4, 1)	1.0
  (5, 0)	1.0
  (6, 0)	1.0
  (7, 0)	1.0
  (8, 0)	1.0
  (9, 0)	1.0
  (10, 0)	1.0
  (11, 1)	1.0
  (12, 1)	1.0
  (13, 0)	1.0
  (14, 2)	1.0

In [27]:
#정규화 (모든 데이터를 0~1 또는 -1~1로 표현)
import pandas as pd 
import numpy as np
df=pd.read_csv('./part4/auto-mpg.csv',header=None)
df.columns=['mpg','cylinders','displacement','horsepower','weight','acceleration','model year','origin','name']
df['horsepower'].replace('?',np.nan,inplace=True)# ? NaN으로 변경
df.dropna(subset=['horsepower'],axis=0,inplace=True)# 누락행 제거
df['horsepower']= df['horsepower'].astype('float')#실수형을 변환

print(df.horsepower.describe())# 정보확인으로 max값 확인
print("\n")

df.horsepower =df.horsepower/abs(df.horsepower.max())# 최대값의 절대값으로 모든 데이터 나눠 저장
print(df.horsepower.head())
print("\n")
print(df.horsepower.describe())

count    392.000000
mean     104.469388
std       38.491160
min       46.000000
25%       75.000000
50%       93.500000
75%      126.000000
max      230.000000
Name: horsepower, dtype: float64


0    0.565217
1    0.717391
2    0.652174
3    0.652174
4    0.608696
Name: horsepower, dtype: float64


count    392.000000
mean       0.454215
std        0.167353
min        0.200000
25%        0.326087
50%        0.406522
75%        0.547826
max        1.000000
Name: horsepower, dtype: float64

In [41]:
#시계열 데이터 

#문자열 Timestamp로 변환


import pandas as pd 

df = pd.read_csv('./part5/stock-data.csv')
print(df.head())
print('\n')
print(df.info())

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB
None

In [42]:
df['new_Date']=pd.to_datetime(df['Date'])
print(df.head())
print("\n")
print(df.info())
print("\n")
print(type(df['new_Date'][0]))

         Date  Close  Start   High    Low  Volume   new_Date
0  2018-07-02  10100  10850  10900  10000  137977 2018-07-02
1  2018-06-29  10700  10550  10900   9990  170253 2018-06-29
2  2018-06-28  10400  10900  10950  10150  155769 2018-06-28
3  2018-06-27  10900  10800  11050  10500  133548 2018-06-27
4  2018-06-26  10800  10900  11000  10700   63039 2018-06-26


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20 non-null     object
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
 6   new_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB
None


<class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [43]:
#new_date 를 인덱스로 지정하고 기존 date 제거

#df.index=df['new_Date']
df.set_index('new_Date',inplace=True)
df.drop('Date',axis=1,inplace=True)
print(df.head())

            Close  Start   High    Low  Volume
new_Date
2018-07-02  10100  10850  10900  10000  137977
2018-06-29  10700  10550  10900   9990  170253
2018-06-28  10400  10900  10950  10150  155769
2018-06-27  10900  10800  11050  10500  133548
2018-06-26  10800  10900  11000  10700   63039

In [47]:
#Timestamp를 Period로 변환
import pandas as pd 
dates=['2019-01-01','2020-03-01','2021-06-01']
ts_dates =pd.to_datetime(dates)
print(ts_dates)
print("\n")

#period로 변환
pr_day = ts_dates.to_period(freq='D')
print(pr_day)

#D : day
#W : 1주
#M : 월말
#MS : 월초
#Q : 분기말
#QS : 분기초
#A : 연말
#AS : 연초
#H: 1시간.....등

DatetimeIndex(['2019-01-01', '2020-03-01', '2021-06-01'], dtype='datetime64[ns]', freq=None)


PeriodIndex(['2019-01-01', '2020-03-01', '2021-06-01'], dtype='period[D]', freq='D')

In [48]:
# TimeStamp 배열 만들기
ts_ms = pd.date_range(start='2019-01-01',# 날짜 범위 시작
                     end=None,# 날짜 범위 끝
                     periods=6,# 생성할 TimeStamp 수
                     freq='MS', # 간격 (월 시작일)
                     tz='Asia/Seoul')# 시간대

print(ts_ms)

DatetimeIndex(['2019-01-01 00:00:00+09:00', '2019-02-01 00:00:00+09:00',
               '2019-03-01 00:00:00+09:00', '2019-04-01 00:00:00+09:00',
               '2019-05-01 00:00:00+09:00', '2019-06-01 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='MS')

In [49]:
#period 배열 만들기
pr_m= pd.period_range(start ='2019-01-01',
                     end=None,
                     periods=3,
                     freq='M')

print(pr_m)

PeriodIndex(['2019-01', '2019-02', '2019-03'], dtype='period[M]', freq='M')

In [52]:
#시계열 데이터 활용
#날짜 데이터 분리 
df = pd.read_csv('./part5/stock-data.csv')
df['new_Date']=pd.to_datetime(df['Date'])
df['Year']=df['new_Date'].dt.year
df['Month']=df['new_Date'].dt.month
df['Day']=df['new_Date'].dt.day

print(df.head())

         Date  Close  Start   High    Low  Volume   new_Date  Year  Month  Day
0  2018-07-02  10100  10850  10900  10000  137977 2018-07-02  2018      7    2
1  2018-06-29  10700  10550  10900   9990  170253 2018-06-29  2018      6   29
2  2018-06-28  10400  10900  10950  10150  155769 2018-06-28  2018      6   28
3  2018-06-27  10900  10800  11050  10500  133548 2018-06-27  2018      6   27
4  2018-06-26  10800  10900  11000  10700   63039 2018-06-26  2018      6   26

In [55]:
#Timestamp를 period로 변환하여 표기 변경
df['Date_yr']=df['new_Date'].dt.to_period(freq='A')
df['Date_m']=df['new_Date'].dt.to_period(freq='M')
print(df.head())

         Date  Close  Start   High    Low  Volume   new_Date  Year  Month  \
0  2018-07-02  10100  10850  10900  10000  137977 2018-07-02  2018      7
1  2018-06-29  10700  10550  10900   9990  170253 2018-06-29  2018      6
2  2018-06-28  10400  10900  10950  10150  155769 2018-06-28  2018      6
3  2018-06-27  10900  10800  11050  10500  133548 2018-06-27  2018      6
4  2018-06-26  10800  10900  11000  10700   63039 2018-06-26  2018      6

   Day Date_yr   Date_m
0    2    2018  2018-07
1   29    2018  2018-06
2   28    2018  2018-06
3   27    2018  2018-06
4   26    2018  2018-06